content/topics/second_brain.md
+++
title = "Second Brain"
author = ["hermes"]
draft = false
+++

About building a braindump, second brain, digital garden...


## Resources {#resources}

-   2022-10-04 ◦ [Home - Knowledge-base](https://yoan-thirion.gitbook.io/knowledge-base/)
-   2026-06-02 ◦ [LLM wiki gist (Karpathy)](https://gist.github.com/karpathy/442a6bf555914893e9891c11519de94f) — the [LLM wiki]({{< relref "llm_wiki.md" >}}) pattern addresses the classic failure mode of second-brain systems (maintenance cost unsustainability) by delegating all organisational work to an LLM

    > Humans abandon wikis because the maintenance burden grows faster than the value. LLMs don't get bored and can touch 15 files in one pass.
-   2026-06-18 ◦ [Am I missing the point of AI agents? (Reddit r/hermesagent)](https://www.reddit.com/r/hermesagent/comments/1tlh53c/am_i_missing_the_point_of_ai_agents/) — a practitioner fed mail archives, browser bookmarks, and watch history to a personal [AI agent]({{< relref "ai_agents.md" >}}) and received an IKIGAI brief (purpose/passion/vocation/profession intersections) plus strategic personal development plans; treating the second brain as an active analysis engine rather than passive storage
